01_Dummy_cases/02_A02_Rotor/03_A02_Dummy_RM/0/initialConditions
compressible 0;
lowRE 0;

Ufarfield 50.69;

I 0.05;

lengthscale #calc "0.05*0.75";

kfarfield #calc "3/2*pow($Ufarfield*$I,2)";

epsilonfarfield #calc "(pow(0.09,0.75)*pow($kfarfield,1.5))/($lengthscale)";