01_Dummy_cases/02_A02_Rotor/03_A02_Dummy_RM/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        action  new;
        type    cellSet;
        name    Rotor_CellSet;
        source  cylinderToCell;

        p1 (0 0 -0.1);
        p2 (0 0 0.75);
        
        radius 1;
    }

    {
        action  new;
        type    cellZoneSet;
        name    Rotor;

        source  setToCellZone;
        set Rotor_CellSet;
    }


);

// ************************************************************************* //
